import React from "react";

function Introduction() {
  return (
    <div className="body">
      <h1 className="title">Введение Дорогие ребята!</h1>
      <p className="text">
        Вы видите пособие по курсу для программистов, которые уже изучили основы
        программирования на языке "Jауа" и решили продолжить свое развитие. В
        первом модуле курса на вас обрушилось много новой информации, при этом
        вы смогли не только наблюдать, но и лично участвовать в процессе
        создания компьютерной игры. Вы поняли, что за написанием компьютерной
        игры стоит определенный труд, который требует навыков и опыта
        программирования. Если эти трудности не испугали вас, то вы уже добились
        определенного результата. Давайте еще раз вспомним известную фразу:
        "Программистами не рождаются — программистами становятся!" Как и в любом
        другом деле вы сможете добиться результата, только если будете прилагать
        усилия. Важное качество в изучении программирования — это умение не
        сдаваться!
      </p>
      <p className="text">
        Во втором модуле курса мы будем рассматривать написание различных
        приложений с помощью языка Java, не ограничиваясь уже только созданием
        игр. Мы познакомимся с такими темами как: работа с мышью, построение
        пользовательского интерфейса, работа с файловой системой и базой данных,
        рассмотрим создание веб-страницы и веб-приложения. Изучим принципы
        создания "блокировщика" Windows для достижения полезных результатов,
        создадим калькулятор.
      </p>
      <p className="text">
        Наблюдая и изучая построение разносторонних приложений, вы сможете
        глубоко проникнуть в суть разработки программного обеспечения. Вы
        увидите, что существует много принципиально общего в создании как
        компьютерных игр, так и любых других приложений. Язык Java позволяет вам
        создавать приложения любого характера, реализовать любые ваши идеи. При
        этом вы можете создавать эти приложения не только для операционной
        системы Window, но и для Мас OS и пах, что особенно приятно, с учетом их
        возрастающей популярности.
      </p>
    </div>
  );
}

export default Introduction;
